%计算无应力索长

%参考文献：
%1、《悬索桥》孟凡超 2011 P61

%计算绶溪公园过溪桥跨中无应力长度

clear;clc;

f=9;l=70;

n=f/l;  %矢跨比

S=(l/2)*(1+16*n^2)^0.5+0.125*(l/n)*log(4*n+(1+16*n^2)^0.5);
%S=l*(1+8/(3*n^2)-32/(5*n^4));     %有应力索长估算公式

%空缆状态下主缆有应力索长
Ec=2.0*10^11;   %主缆弹性模量(国际单位）
Ac=0.25*pi*0.10695^2;   %主缆面积（国际单位）

gb=168000;   %加劲梁自重

H=gb*l^2/(8*f);
H=5.9654e+06;

deltaS1=(H*l)*(1+(16*n^2/3))/(Ec*Ac);
S1=S-deltaS1;

%无应力索长
gc=8.348*10^4;   %缆索自重
c=l^2/(8*f);
c=69.5058;
Hc=c*gc;    %缆索在自重状态下的水平拉力

deltaS2=Hc*(l+c*sinh(l/c))/(2*Ec*Ac);

S0=S-deltaS1-deltaS2;


